

//2020/03/15/15：39		测试正常运行


/*------------------------------传感器单元说明------------------------------------------------------------------------*//*

DHT11温湿度传感器，采用单总线数据访问通信方式，这里移植修改的STM32例程，区别是不用重复设置IO的方向

MQ-2烟雾浓度传感器，利用AD转换芯片ADC0832完成采集，采集结果串行输出





*//*-----------------------------------------------------------分割线-------------------------------------------------------------------*/
//



#ifndef __Sensor_H__
#define __Sensor_H__

#include "include.h"


uchar DHT11_GetValue(uchar *temp,uchar *humi);

uint Get_AD_Value(uchar ch);


#endif


